zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxPsi5_regdef.h
/** \brief RSI Overview Clear Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_PSI5_RSICLR_Bits B;           /**< \brief Bitfield access */
} Ifx_PSI5_RSICLR;

/** \brief RSI Overview Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_PSI5_RSIOV_Bits B;            /**< \brief Bitfield access */
} Ifx_PSI5_RSIOV;

/** \brief RSI Overview Set Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_PSI5_RSISET_Bits B;           /**< \brief Bitfield access */
} Ifx_PSI5_RSISET;

/** \brief TEI Overview Clear Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_PSI5_TEICLR_Bits B;           /**< \brief Bitfield access */
} Ifx_PSI5_TEICLR;

/** \brief TEI Overview Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_PSI5_TEIOV_Bits B;            /**< \brief Bitfield access */
} Ifx_PSI5_TEIOV;

/** \brief TEI Overview Set Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_PSI5_TEISET_Bits B;           /**< \brief Bitfield access */
} Ifx_PSI5_TEISET;

/** \brief Module Time Stamp Register A   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_PSI5_TSRA_Bits B;             /**< \brief Bitfield access */
} Ifx_PSI5_TSRA;

/** \brief Time Stamp Register B   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_PSI5_TSRB_Bits B;             /**< \brief Bitfield access */
} Ifx_PSI5_TSRB;

/** \brief Module Time Stamp Register C   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_PSI5_TSRC_Bits B;             /**< \brief Bitfield access */
} Ifx_PSI5_TSRC;

/** \}  */

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Psi5_CH_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief CH object */
typedef volatile struct _Ifx_PSI5_CH
{
       Ifx_PSI5_CH_IOCR                    IOCR;                   /**< \brief 0, Input and Output Control Register ${x}*/
       Ifx_PSI5_CH_RCRA                    RCRA;                   /**< \brief 4, Receiver Control Register A ${x}*/
       Ifx_PSI5_CH_RCRB                    RCRB;                   /**< \brief 8, Receiver Control Register B ${x}*/
       Ifx_PSI5_CH_RCRC                    RCRC;                   /**< \brief C, Receiver Control Register C ${x}*/
       Ifx_PSI5_CH_WDT                     WDT[7];                 /**< \brief 10, Watch Dog Timer Register ${x}${w}*/
       Ifx_PSI5_CH_RSR                     RSR;                    /**< \brief 2C, Receive Status Register ${x}*/
       Ifx_PSI5_CH_SDS                     SDS[6];                 /**< \brief 30, Serial Data and Status Register ${x}${z}*/
       Ifx_PSI5_CH_SPTSC                   SPTSC;                  /**< \brief 48, Start of Pulse Time Stamp Capture Register ${x}*/
       Ifx_PSI5_CH_SFTSC                   SFTSC;                  /**< \brief 4C, Start of Frame Time Stamp Capture Register ${x}*/
       Ifx_PSI5_CH_RDRL                    RDRL;                   /**< \brief 50, Receive Data Register Low ${x}*/
       Ifx_PSI5_CH_RDRH                    RDRH;                   /**< \brief 54, Receive Data Register High ${x}*/
       Ifx_PSI5_CH_PGC                     PGC;                    /**< \brief 58, Pulse Generation Control Register ${x}*/
       Ifx_PSI5_CH_CTV                     CTV;                    /**< \brief 5C, Channel Trigger Value Register ${x}*/
       Ifx_PSI5_CH_SCR                     SCR;                    /**< \brief 60, Send Control Register ${x}*/
       Ifx_PSI5_CH_SDRL                    SDRL;                   /**< \brief 64, Send Data Register Low ${x}*/
       Ifx_PSI5_CH_SDRH                    SDRH;                   /**< \brief 68, Send Data Register High ${x}*/
       Ifx_PSI5_CH_SSRL                    SSRL;                   /**< \brief 6C, Send Shift Register Low ${x}*/
       Ifx_PSI5_CH_SSRH                    SSRH;                   /**< \brief 70, Send Shift Register High ${x}*/
       Ifx_PSI5_CH_SORL                    SORL;                   /**< \brief 74, Send Output Register Low ${x}*/
       Ifx_PSI5_CH_SORH                    SORH;                   /**< \brief 78, Send Output Register High ${x}*/
       Ifx_UReg_8Bit                       reserved_7C[20];        /**< \brief 7C, \internal Reserved */
} Ifx_PSI5_CH;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Psi5_Registers_struct
 * \{  */
/******************************************************************************/
/** \name Object L2
 * \{  */
/** \brief RDM object */
typedef volatile struct _Ifx_PSI5_RDM
{
       Ifx_PSI5_RDM_L                      L;                      /**< \brief 0, Receive Data Memory Low ${x}${y}*/
       Ifx_PSI5_RDM_H                      H;                      /**< \brief 4, Receive Data Memory High ${x}${y}*/
} Ifx_PSI5_RDM;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Psi5_Registers_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

